https://colab.research.google.com/drive/1OX3DFYTgaHcBIddtcxiLSf7IZfzPy8EE?usp=sharing

Задание на добавление столбца

Создадим базу данных и таблицу для проверки нашего решения

In [ ]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('mydatabase.db')

cursor = conn.cursor()

In [ ]:
cursor.execute(
'''
CREATE TABLE table1
    (
      id INTEGER PRIMARY KEY AUTOINCREMENT,
      absolutely_random_value REAL
    )
''')
conn.commit()

In [ ]:
# Тут просто генерируем какие-то рандомные значения и рандомное количество строк
from random import randint
values = [((i/randint(10,20)),) for i in range(randint(0,randint(0,150000)))]

cursor.executemany('''
   INSERT INTO table1
   (absolutely_random_value)
   VALUES
   (?)''', (values))
conn.commit()

In [ ]:
# Посмотрим что получилось
pd.read_sql('SELECT * FROM table1 LIMIT 10', conn)

   id  absolutely_random_value
0   1                 0.000000
1   2                 0.066667
2   3                 0.111111
3   4                 0.300000
4   5                 0.222222
5   6                 0.277778
6   7                 0.333333
7   8                 0.538462
8   9                 0.470588
9  10                 0.562500

In [ ]:
# Добавим столбец по заданию
cursor.execute(
'''
ALTER TABLE table1 ADD COLUMN row_count INTEGER;

''')
conn.commit()

In [ ]:
# Присвоем значения каждой строке
cursor.execute(
'''
UPDATE table1 SET row_count = (SELECT COUNT(*) FROM table1)

''')
conn.commit()

In [ ]:
# Посмотрим что получилось
pd.read_sql('SELECT * FROM table1', conn)

          id  absolutely_random_value  row_count
0          1                 0.000000      10756
1          2                 0.066667      10756
2          3                 0.111111      10756
3          4                 0.300000      10756
4          5                 0.222222      10756
...      ...                      ...        ...
10751  10752               565.842105      10756
10752  10753              1075.200000      10756
10753  10754               896.083333      10756
10754  10755               566.000000      10756
10755  10756               597.500000      10756

[10756 rows x 3 columns]